[{"category": "business", "title": "Sensex, Nifty end at fresh closing highs", "content": "Benchmark indices Sensex and Nifty ended at record closing highs on Wednesday. Sensex ended 195 points higher at 63,523 while the Nifty ended at 18,856.85, up 40 points. The gains were led by stocks like HDFC, Reliance Industries and TCS. During the intraday trade, Sensex rose to its fresh record high level of 63,588. "}, {"category": "business", "title": "TIME releases list of the world's 100 most influential companies", "content": "TIME magazine has released its annual list of the world's 100 most influential companies, which features OpenAI, SpaceX, Chess.com, Google DeepMind and Kim Kardashian's SKIMS among others. The National Payments Corporation of India (NPCI) and e-commerce platform Meesho also featured on the list. \"NPCI launched UPI...which accounted for 52% of India's digital transactions in FY22,\" TIME said."}, {"category": "business", "title": "Which are the world's top 10 airlines according to passengers?", "content": "Singapore Airlines is the world's best airline, according to Skytrax World Airline Awards 2023, an annual poll of flyers released at the Paris Air Show. It is followed by Qatar Airways, All Nippon Airways, Emirates, Japan Airlines, Turkish Airlines, Air France, Cathay Pacific, EVA Air, and Korean Air. Vistara, ranked 16th, is the only Indian airline in the top 20."}, {"category": "business", "title": "Loves India, is a fan of PM: Paytm Founder on Musk after Modi meet", "content": "Paytm Founder Vijay Shekhar Sharma shared a video of Tesla CEO Elon Musk's media interaction after meeting with PM Modi and wrote, \"Musk may be in India, next year.\" In another tweet, Sharma said, \"He [Musk] won't find population problem in India. Finds clean energy, energy storage and EVs as great potential...Loves India and is a fan of our PM.\""}, {"category": "business", "title": "UK's net debt passes 100% of GDP for the first time since 1961", "content": "The United Kingdom's public sector net debt in May exceeded 100% of the nation's GDP for the first time since 1961, the UK government's Office for National Statistics said on Wednesday. Public sector net debt, excluding that of state-controlled banks, hit £2.567 trillion, equivalent to 100.1% of the UK's GDP. The UK government's borrowing in May totalled £20.045 billion.\n\n"}, {"category": "business", "title": "Sylvester daCunha, the man behind iconic Amul girl, passes away", "content": "Sylvester daCunha, the creator of the Amul brand campaign featuring its iconic 'Amul girl' mascot, passed away in Mumbai. \"Along with the legendary Verghese Kurien, it was Sylvester daCunha who had initiated our iconic topical campaign in 1966, which is one of longest continuously running advertising campaigns in the world,\" Pavan Singh, General Manager-Marketing at Amul India, said."}, {"category": "business", "title": "Mcap of BSE-listed firms hits fresh record high of ₹294.5 lakh cr", "content": "The market capitalisation of BSE-listed firms hit a new record high of ₹294.5 lakh crore in morning trade on Wednesday. This comes as Sensex also reached its lifetime peak of 63,588 as it rose 260 points or 0.41% on Wednesday. The previous peak that Sensex had achieved was 63,583, which it scaled on December 1 last year."}, {"category": "business", "title": "OLX Group fires 800 employees globally: Report", "content": "Online marketplace OLX Group has decided to lay off 800 employees globally, reported TechCrunch. As per the report, the move comes as the company started to close operations of its automotive business unit OLX Autos in some markets. Notably, these job cuts come after OLX confirmed plans to decrease its global workforce by 15% (nearly 1,500 jobs) in January."}, {"category": "business", "title": "McD employees, customer throw drinks at each other in Aus; company responds", "content": "A video of McDonald's employees and a customer throwing drinks at each other in Australia has gone viral. \"What's not shown in the video is the customer earlier entering the restaurant and going behind the counter to disrupt kitchen and threaten crew,\" McDonald's said. \"The behaviour of our employees in this video isn't in accordance with our policies,\" it added."}, {"category": "business", "title": "Yoga a global product made in India: Zerodha CEO Nithin Kamath", "content": "On International Yoga Day, Zerodha CEO Nithin Kamath tweeted, \"We don't need a day to remind us, but Yoga is the most accessible way to get healthier, both physically and mentally. It's a truly global product made in India.\" He further said, \"As I've grown older, yoga has helped me with flexibility and avoiding injuries. An underappreciated aspect of Yoga.\"\n"}, {"category": "business", "title": "Trying to help India, US develop strong defence ties: USIBC Prez", "content": "On PM Narendra Modi's state visit to the US, US-India Business Council (USIBC) President Atul Keshap said, \"We are trying to help the US and India develop the strongest possible defence ties for our shared prosperity of the two countries.\" \"The state visit of PM Modi is the strategic, economic and technological convergence of the US and India,\" he added."}, {"category": "business", "title": "Yoga helped me recover from a severe back injury: Bajaj Auto MD", "content": "On International Yoga Day, Bajaj Auto MD Rajiv Bajaj discussed how yoga helped him overcome challenging times, both in his personal and professional life. He said he suffered a severe back injury in 2012 that necessitated bed rest and potential spinal surgery. However, upon his mentor BKS Iyengar's recommendation, he turned to yoga for healing and experienced a significant improvement.\n"}, {"category": "business", "title": "Finland's central bank governor Olli Rehn to run for President", "content": "Finnish central bank Governor Olli Rehn on Wednesday announced he plans to run for President next year. The 61-year-old said he'll take leave from his role at the Bank of Finland and won't actively perform official duties \"to ensure the independence and integrity\" of the central bank. Rehn must collect 20,000 signatures before he can formally enter the Presidential race. "}, {"category": "business", "title": "SpiceJet shares rise 7% after settlement deal with Nordic Aviation", "content": "SpiceJet shares surged by 7% on Wednesday after it entered into a settlement agreement with Nordic Aviation Capital (NAC), a major lessor for its Q400 aircraft. The agreement between the two firms settles all past liabilities of SpiceJet for the five Q400 aircraft leased by NAC. SpiceJet also announced that it'll induct three additional Q400 aircraft, which NAC had repossessed.\n"}, {"category": "business", "title": "Shriram Finance, Piramal Enterprises' shares rise after block deal", "content": "After Piramal Enterprises sold its entire 8.3% stake in Shriram Finance, the latter's shares hit a lifetime high of ₹1,764.45 apiece on the BSE in the early morning trade on Wednesday. Meanwhile, shares of Piramal Enterprises also surged. At 3 pm, Piramal Enterprises' shares were trading 13.66% higher, while Shriram Finance's shares were soaring 11% higher.\n"}, {"category": "business", "title": "You've to be Indian-American to run tech firms, jokes US lawmaker", "content": "Being an Indian-American used to be a challenge, US Congressman Ro Khanna said at INDUS X conference. He joked, \"Now...you almost have to be Indian-American to run one of these tech companies.\" Khanna claimed, \"Everyone in the [Silicon] Valley and other parts of the business world are looking at India as a place where they can diversify their supply chains.\""}, {"category": "business", "title": "Lupin shares hit 52-week high after its inhaler gets USFDA nod", "content": "Shares of Lupin Limited hit their 52-week high of ₹885.30/share on Wednesday after the firm received US Food and Drug Administration's (FDA) approval for its respiratory drug generic Spiriva HandiHaler. Shares of Lupin closed at ₹875.05/share on Wednesday, up 5.41%, taking the drugmaker's market capitalisation close to ₹40,000 crore. Lupin's 52-week low is currently at ₹595/share. "}, {"category": "business", "title": "Akasa to buy 4 more Boeing planes, to place 3-digit order this yr", "content": "Akasa Air said it will buy four more Boeing 737 Max aircraft and also announce a \"three-digit\" aircraft order this year. These four planes will be in addition to the original order book of 72 Boeing 737 Max taking it to a total of 76 aircraft which include 23 737-8s and 53 high-capacity 737-8-200 planes, the airline said.\n"}, {"category": "business", "title": "YEIDA to sell 49 industrial plots in UP, aims to receive ₹86 crore", "content": "Yamuna Expressway Industrial Development Authority (YEIDA) has floated a scheme for allotment of 49 industrial plots in Medical Device Park in Sector 28. The authority aims to receive a revenue of around ₹86 crore by selling these plots, officials said. The plots are close to the upcoming Noida International Airport. As per officials, four plots measure 10,000 square metres each."}, {"category": "business", "title": "Taking SEBI order on ZEE's Chandra, Goenka 'very seriously': Sony", "content": "Sony Pictures said it takes SEBI's interim order barring Zee Entertainment Enterprises (ZEE) Chairman Subhash Chandra and CEO Punit Goenka from holding directorial role in any firm \"very seriously\". The company added that it'll continue to monitor developments that'll affect merger deal between Zee and Sony. SEBI had alleged that Chandra and Goenka were involved in fund diversion."}, {"category": "business", "title": "Cyient DLM IPO to open on Jun 27, price band to be announced later", "content": "The IPO of Cyient DLM will open for subscription on June 27, its parent Cyient Limited said on Wednesday. The price band of the IPO, which will close on June 30, would be announced at least two working days ahead of the opening date, the firm added. Coinciding with the IPO announcement, Cyient shares were down over 1%."}, {"category": "business", "title": "UBS to start Credit Suisse Asia Pacific job cuts in July: Report", "content": "UBS will start cutting Asia investment banking jobs at Credit Suisse in July, Reuters cited three sources as saying. In the Asia Pacific region, there will be a significant reduction in Credit Suisse investment bankers covering Australia and China, where the two banks overlap most, two sources said. UBS completed its emergency takeover of rival Credit Suisse last week.\n"}, {"category": "business", "title": "Govt's rice procurement reaches 55.8 mn tonnes in 2022-23 so far", "content": "Indian government has procured 55.8 million tonnes of rice so far in the 2022-2023 marketing season. The operation benefitted 1.22 crore farmers, who were paid ₹1,71,000 crore as MSP. Government has a target of buying 62.60 million tonnes of rice in the season. Government's wheat procurement has reached 26.2 million tonnes so far in the 2023-2024 rabi marketing year (April-March)."}, {"category": "business", "title": "Why has SEBI imposed a 2-yr ban on IIFL Securities?", "content": "SEBI has banned IIFL Securities from onboarding new clients for two years. According to SEBI's order in the matter, the ban has been imposed as IIFL Securities failed to segregate its own funds from clients' funds and misused credit balances in clients' funds for benefit of clients having debit balance. IIFL also inappropriately designated client bank accounts, the order added."}, {"category": "business", "title": "JPMorgan cuts 20 investment banking jobs in Asia: Report", "content": "In its second round of layoffs in Asia this year, US-headquartered JPMorgan Chase & Co has cut around 20 investment banking jobs, Reuters reported. Majority of the affected bankers are at junior ranks from analysts to executive directors, the report added. Last week, US investment banking company Goldman Sachs announced that it's cutting over 30 banking jobs in Asia."}, {"category": "sports", "title": "Latest rankings for Test batters released, Root jumps 5 spots to become world number one", "content": "The ICC on Wednesday released latest rankings for Test batters following the conclusion of first Ashes 2023 Test. Ex-England captain Joe Root jumped five spots to become the new world number one Test batter, displacing Marnus Labuschagne, who is now ranked third. Steve Smith has dropped to the sixth spot, while New Zealand's Kane Williamson is now ranked second."}, {"category": "sports", "title": "Suryakumar Yadav shares pic of his 360-degree shots on International Yoga Day", "content": "Cricketer Suryakumar Yadav took to his Instagram Stories to share a picture of his 360-degree shots on the occasion of International Yoga Day. \"International Yoga Day, it is...Wishing everyone good health and peace,\" he wrote. Suryakumar scored 605 runs in IPL 2023, his best performance in an IPL season."}, {"category": "sports", "title": "Grandmaster Praggnanandhaa gets question on Chess Olympiad in Class 12 exam, shares pic", "content": "India's 17-year-old Chess Grandmaster R Praggnanandhaa took to Twitter to share a picture of his Class 12 English exam question paper, revealing that he got a question on the recent Chess Olympiad. \"I was happy to see this question appear,\" Praggnanandhaa tweeted. \"You had a checkmate moment!\" a Twitter user commented. \"This is cool,\" wrote another. "}, {"category": "sports", "title": "Pakistan's internal note regarding ODI World Cup 2023 venues in India leaked", "content": "Pakistan Cricket Board's internal note regarding ODI World Cup 2023 venues has been leaked. The note accessed by ESPNcricinfo says, \"Australia in Bengaluru & Afghanistan in Chennai are...two...we should look to get changed as much as possible.\" It further says, \"Ideally...we can switch these around. Australia in Chennai & Afghanistan in Bengaluru would make us obvious favourites in both matches.\""}, {"category": "sports", "title": "Police entered our house, asked 'Who killed Gulshan Kumar?': Manav Kaul on 1997 incident", "content": "Actor Manav Kaul recalled how he mistakenly became a suspect in 1997 murder case of T-Series founder Gulshan Kumar. Manav revealed he used to stay with his friends in a residential society and someone from his society became suspicious of their activities. He added, \"One night...we were playing cards and suddenly police...entered our house and...asked, 'Who killed Gulshan Kumar?'\""}, {"category": "sports", "title": "People assumed I am pacifying him: CSK CEO on viral video of his chat with Jadeja", "content": "Talking about a video that went viral showing him talking to Ravindra Jadeja amid talks of Jadeja's rift with MS Dhoni, CSK CEO Kasi Viswanathan said, \"People...assumed I'm pacifying Jadeja...but it wasn't like that.\" He added, \"I was talking to him about the match...what he did.\" Viswanathan clarified, \"We don't have any problem. He always had high respect for Dhoni.\""}, {"category": "sports", "title": "Iceland Cricket troll England with 'Bazball 0-1 Basic Common Sense' tweet", "content": "Iceland Cricket have trolled England after their defeat against Australia in the first Ashes 2023 Test at Edgbaston. \"Bazball 0-1 Basic Common Sense,\" Iceland Cricket tweeted. Australia defeated England by chasing down a target of 281 with 4.3 overs to spare on the last day. Earlier in the Test, England had declared their first innings at 393/8 on Day 1."}, {"category": "sports", "title": "Cummins gave away four on 1st ball of 1st Ashes 2023 Test, smashed a four on last ball", "content": "Australia captain Pat Cummins conceded a four on the first ball of the first Ashes 2023 Test on June 16 and went on to smash a four to win the Test for Australia. Cummins scored four wickets in the match and scored an 44*(73) in the second innings as Australia recorded their highest successful chase in Ashes in 75 years."}, {"category": "sports", "title": "Rishabh Pant top-ranked Indian Test batter despite not playing for 6 months ", "content": "Wicketkeeper-batter Rishabh Pant is the top-ranked Indian Test batter despite not playing a Test in six months due to injuries sustained in a car accident. Pant, who is ranked 10th, is the only Indian batter in top 10. He's followed by Rohit Sharma (12th). Virat Kohli has dropped one spot and is currently ranked 14th. Cheteshwar Pujara is ranked 25th."}, {"category": "sports", "title": "MS Dhoni never complained about his knee to anybody: CSK CEO Kasi Viswanathan", "content": "CSK CEO Kasi Viswanathan revealed CSK captain MS Dhoni never complained about his knee to anybody throughout IPL 2023 season. \"Though everyone knew, and you would've seen him struggling while running, he never complained even once,\" Viswanathan added. He further said, \"After the final, Dhoni said, 'Okay, I'll have a surgery.' He's finished his surgery, he's quite happy, he's recovering.\""}, {"category": "sports", "title": "He might have felt hurt: CSK CEO on Jadeja's viral tweet after 'We want Dhoni' chants", "content": "Reacting to Ravindra Jadeja's viral tweet wherein he took an indirect dig at fans chanting 'We want Dhoni' whenever he used to come to bat before MS Dhoni, CSK CEO Kasi Viswanathan said, \"He may have felt hurt.\" He added, \"Any player for that matter may have had that pressure..,but he didn't complain...even though he put out a tweet.\""}, {"category": "sports", "title": "Eng were bullying Aus, game changed when Aus gave it back: Harsha", "content": "Commentator Harsha Bhogle took to Twitter to state that England were bullying Australia in the Edgbaston Test at one point. \"The moment Australia tried to give it back, the game looked different,\" added Harsha. Australia recorded their highest successful run chase in Ashes in 75 years, chasing down a target of 281 on the final day of the Edgbaston Test."}, {"category": "sports", "title": "Eng got Cummins going by attacking him very aggressively: Healy", "content": "Discussing Australia captain Pat Cummins' unbeaten 44 in the Edgbaston Test which helped his team record their highest successful chase in Ashes in nearly 75 years, ex-Australia wicketkeeper-batter Ian Healy said, \"England...attacked Cummins very aggressively.\" \"England annoyed him. They [spoke] to him when they bowled to him in the first innings...England got him going...with the bat,\" he added."}, {"category": "sports", "title": "Cummins said 'We've scored 50 before, let's do it again': Lyon", "content": "Discussing his unbeaten partnership of 55 runs with Australia captain Pat Cummins on Day 5 of Edgbaston Test against England, Australian spinner Nathan Lyon said, \"Cummins had a massive smile on his face when I walked out.\" \"He said, 'We've put on 50 before...Let's just do it again',\" added Lyon. \"Cummins was pretty calm the whole time,\" he stated."}, {"category": "sports", "title": "Can't recall Anderson not taking 2nd new ball in Eng: Vaughan", "content": "Ex-England captain Michael Vaughan said he can't recall the last time pacer James Anderson didn't bowl with the second new ball in English conditions. \"You just felt, go on James Anderson and Stuart Broad...nice and straight to Nathan Lyon,\" Vaughan stated. Broad and Ollie Robinson bowled with the second new ball in the fourth innings of first Ashes 2023 Test.\n"}, {"category": "sports", "title": "Shaheen nails yorker, sends middle-stump cartwheeling in last over", "content": "Pakistani pacer Shaheen Afridi nailed a yorker and sent the middle-stump cartwheeling to pick two wickets in the final over of a T20 Blast 2023 match between Leicestershire and Nottinghamshire, where he was representing the latter. Shaheen made a comeback after conceding a four off the first delivery of the over, accounting for dismissals off the second and fifth delivery."}, {"category": "sports", "title": "Zverev beats Thiem in 79 mins in first grass-court match in 2 yrs", "content": "World number 22 Alexander Zverev defeated 89th-ranked Dominic Thiem at the Terra Wortmann Open on Tuesday. It was both men's first grass-court match since 2021. The 26-year-old defeated Thiem with a scoreline of 6-3, 6-4 in the match which lasted for one hour and 19 minutes. Zverev will play against Canada's Denis Shapovalov in the second round.\n"}, {"category": "sports", "title": "Kanté joins Al Ittihad post 7-yr Chelsea stint, to earn ₹900 cr/yr", "content": "Chelsea midfielder N'Golo Kanté will leave the club after seven years and join Saudi Pro League club Al Ittihad on a three-year contract. According to reports, Kanté will earn over ₹900 crore a year. Kanté won several trophies with Chelsea including Champions League and Premier League. Recently, Ballon d'Or winner Karim Benzema had signed a two-year contract with Al Ittihad. \n"}, {"category": "sports", "title": "Told teammates post Perry's 213* 'They won't get any of us': Tammy", "content": "Discussing Australian all-rounder Ellyse Perry's 213* during her team's Test match against England Women in November 2017, England opener Tammy Beaumont said, \"I told my teammates [after her knock], 'They're getting none of us tonight'.\" \"I came back with [opener] Lauren Winfield-Hill. We...actually hit their opening bowler out of the attack. We drew the Test the next day,\" added Beaumont."}, {"category": "sports", "title": "Test cricket is best cricket, Cummins Tests' new Mr Cool: Sehwag", "content": "Talking about first Ashes 2023 Test where Australia defeated England, ex-India cricketer Virender Sehwag said, \"Test cricket is Best Cricket.\" Praising Australia captain Pat Cummins for his knock of 44* in second innings, Sehwag stated, \"Cummins is...new Mr Cool in Test cricket.\" He added it was one of the best Test matches he has seen in \"recent times\".\n"}, {"category": "sports", "title": "England could lose every Test if they play 'Bazball': Healy", "content": "Ex-Australia cricketer Ian Healy said England \"could lose every Test\" of Ashes 2023 if they continue playing with 'Bazball' approach. \"That's Australia's job to get that into their minds so...they don't trust their plan anymore,\" Healy stated. However, he said 'Bazball' is a \"really gutsy way to play\". Australia defeated England by two wickets in first Ashes 2023 Test.\n"}, {"category": "sports", "title": "Video shows India's 84th minute winner when they last faced Pak", "content": "The Indian football team recorded a 3-1 win against Pakistan following an 84th minute winner by forward Sumeet Passi, when the teams last faced off in 2018 SAFF Championship semi-final. Indian forward Manvir Singh scored a brace in the match. India and Pakistan will face off after nearly five years today in their opening match of SAFF Championship 2023."}, {"category": "sports", "title": "Desperate to entertain: Hussain on Stokes' declaration on Day 1", "content": "Defending England captain Ben Stokes' decision of declaring the first innings on Day 1 of first Ashes 2023 Test, ex-England captain Nasser Hussain said Stokes \"will get it wrong occasionally but he's desperate to entertain\". \"This England team have their own logic,\" Hussain stated. England declared the innings at 393/8 on Day 1. Australia defeated England by two wickets.\n"}, {"category": "sports", "title": "Video shows Eng taking Aus' last wicket on 1982 Test's last day", "content": "Cricket Australia has shared a throwback video showing England's Ian Botham taking the wicket of Australia's Jeff Thomson to win a 1982 Ashes Test match for the team. Australia needed 37 runs to win while England needed one wicket to emerge victorious on the last day of the match. Allan Border scored 62* runs in the fourth innings.\n"}, {"category": "sports", "title": "Liverpool's Diaz scores as Colombia record historic win vs Germany", "content": "Liverpool attacker Luis Díaz and Juventus midfielder Juan Cuadrado scored as Colombia defeated Germany 2-0 in a friendly match, recording their first-ever win against the latter. The two teams were facing each other for the fifth time. Germany have won three of their last 11 matches. \"Everything's missing...Everything is going against us at the moment,” stated Germany midfielder Leon Goretzka."}, {"category": "technology", "title": "Elon Musk meets PM Modi, says 'I am a fan of Modi'", "content": "Tesla CEO and Twitter owner Elon Musk met Prime Minister Narendra Modi in New York on Tuesday. \"I am a fan of Modi...I like him quite a lot,\" Musk said. \"PM Modi really cares about India because he is pushing us to make significant investment in India, which is something that we tend to do,\" he further said."}, {"category": "technology", "title": "Great meeting you: PM Modi while sharing pic from meeting with Musk", "content": "After meeting the world's richest man and Tesla CEO Elon Musk in the US, Prime Minister Narendra Modi tweeted a photo with him. PM Modi wrote, \"Great meeting you today, Elon Musk. We had multifaceted conversations on issues ranging from energy to spirituality.\" Referring to their meeting, Tesla CEO also tweeted, \"It was an honour to meet again.\""}, {"category": "technology", "title": "I am incredibly excited about the future of India: Elon Musk on meeting PM Modi", "content": "Commenting on his meeting with Prime Minister Narendra Modi, Elon Musk said, \"I am incredibly excited about the future of India. I think India has more promise than any large country in the world.\" \"PM Modi wants...to be supportive to the companies. And obviously, at the same time, make sure that it accrues to India's advantage,\" Musk added."}, {"category": "technology", "title": "India can show way to world: US economist Romer on Aadhaar after meeting PM Modi", "content": "Nobel prize-winning American economist and former World Bank Chief Economist Paul Romer met Prime Minister Narendra Modi in the US. Appreciating India's Aadhaar-based authentication, Romer said that the country can \"show the way to the world\". He added, \"It was a great meeting. We talked about the importance of successful urban development. He understands these issues very well.\""}, {"category": "technology", "title": "Twitter employees sue company over unpaid bonuses", "content": "A group of employees at Twitter have sued the company, claiming that it has failed to pay out 2022 bonuses. The employees alleged they were promised that these bonuses would be paid at 50% of the target amounts. The proposed class-action complaint was filed by Mark Shobinger, a former senior employee, responsible for overseeing executive and incentive pay. "}, {"category": "technology", "title": "TIME releases list of the world's 100 most influential companies", "content": "TIME magazine has released its annual list of the world's 100 most influential companies, which features OpenAI, SpaceX, Chess.com, Google DeepMind and Kim Kardashian's SKIMS among others. The National Payments Corporation of India (NPCI) and e-commerce platform Meesho also featured on the list. \"NPCI launched UPI...which accounted for 52% of India's digital transactions in FY22,\" TIME said."}, {"category": "technology", "title": "Realme disables feature amid claims it collected SMS, call data", "content": "Realme has released a new update for some models that disables the 'Enhanced Intelligent Services' feature by default. This comes after claims were made that the feature was collecting users' personal data like call logs and SMS messages, and was enabled by default. The latest update also removes the mention of call logs and messages from the feature's description."}, {"category": "technology", "title": "Looking forward to bringing Starlink to India: Musk after meeting PM Modi", "content": "World's richest person and Tesla CEO Elon Musk said that he is looking forward to bringing satellite internet service Starlink to India. \"The Starlink internet...can be incredibly helpful for...remote or rural villages where they perhaps either may have no access to the internet or the internet is very expensive and slow,\" he said after meeting PM Narendra Modi.\n"}, {"category": "technology", "title": "Who is Joseph Tsai, who has been named as Alibaba's next Chairman?", "content": "Alibaba Group on Tuesday said Chairman Daniel Zhang will be succeeded by Joseph Tsai. One of the Co-founders of Alibaba Group, 59-year-old Taiwan-born Tsai studied at Yale University, where he received his undergraduate and law degrees. After graduating, Tsai joined law firm Sullivan & Cromwell as a tax associate and later joined buyout firm Rosecliff before moving to Hong Kong."}, {"category": "technology", "title": "'Cis' or 'cisgender' are considered slurs on Twitter: Elon Musk", "content": "Elon Musk has said that the words \"cis\" or \"cisgender\" are considered slurs on Twitter. He added, \"Repeated, targeted harassment against any account will cause the harassing accounts to receive, at minimum, temporary suspensions.\" According to Merriam-Webster, 'cisgender' refers to being a person whose gender identity corresponds with the sex the person had or was identified as having at birth."}, {"category": "technology", "title": "Twitter doesn't have a choice but to obey local govts: Musk on Dorsey's claims about India", "content": "After meeting PM Narendra Modi in the US, Tesla CEO and Twitter owner Elon Musk said Twitter doesn't have a choice but to obey local laws. His reaction comes days after ex-Twitter CEO Jack Dorsey said India threatened to shut down the social media website. \"If we don't obey local government laws, we will get shut down,\" said Musk. "}, {"category": "technology", "title": "Tinder removes 5 million spam, bot accounts in Q1 of 2023", "content": "Nearly five million bot and spam accounts were removed from dating app Tinder in the first quarter of 2023. An official of Tinder's parent company Match Group said, \"We...remove the vast majority of spam at sign up or before a user ever sees it.\" \"We are...adding an additional level of security...for users,\" Tinder's SVP of Product Integrity Rory Kozoll said."}, {"category": "technology", "title": "Cabinet clears $2.7-bn Micron chip testing, packaging unit: Report", "content": "The Union Cabinet has cleared US chipmaker Micron Technology's $2.7-billion plan for a new semiconductor testing and packaging unit, Reuters reported on Tuesday, ahead of PM Narendra Modi's state visit to the US. Production-linked incentives worth $1.34 billion were approved for the plant, reportedly set to be built in Gujarat. Cabinet approval was required due to incentive package's size."}, {"category": "technology", "title": "iPhone's crash detection triggers false 911 calls at US festival", "content": "Apple iPhone's crash detection feature triggered multiple accidental 911 calls at a recently-concluded music and arts festival in the US, as per a tweet by local police. \"Please be mindful and consider deactivating this feature on your phone until Bonnaroo concludes,\" the police told attendees. According to Apple, the feature is designed to detect severe car crashes."}, {"category": "technology", "title": "ISRO to set up mobile satellite terminals on 1 lakh fishing boats", "content": "ISRO's commercial arm NewSpace India will install mobile satellite service terminals on at least one lakh fishing boats across nine states and four union territories. The network will help authorities send emergency weather alerts and alert fishermen about international water border violations. India's navigation satellite system NavIC (Navigation with Indian Constellation) will power the network."}, {"category": "technology", "title": "Robot that can move inside humans, perform medical acts created", "content": "As per a paper published in Nature Communications, scientists have created a tiny pangolin-inspired magnetic robot that can move around a human body and perform minimally invasive medical procedures. It is capable of heating up hard-to-reach places, like intestines, or delivering cargo to tissues, scientists suggested. The heat could be used for performing cancer treatment or to mitigate bleeding."}, {"category": "technology", "title": "YouTube to launch 1st official shopping channel in S Korea: Report", "content": "YouTube will launch a shopping channel in South Korea on June 30, local media reported, adding that it'll be the company's first shopping channel in any country. The channel, which will operate in Korean language, will reportedly livestream shopping content from around 30 brands. Shares of NAVER, which already engages in live-streaming commerce business in South Korea, fell on Wednesday."}, {"category": "technology", "title": "Twitter owner Elon Musk, CEO Yaccarino to skip Cannes Lions event", "content": "Twitter owner Elon Musk and CEO Linda Yaccarino are set to skip Cannes Lions International Festival of Creativity, a spokesperson confirmed. The event attracts the industry's influential executives and key advertisers. Twitter's sales team is in Cannes for the event, a report said. On Tuesday, Twitter said it'll explore solutions from companies that specialise in tracking the quality of ads."}, {"category": "technology", "title": "US' largest publisher Gannett sues Google over ad tech monopoly", "content": "Gannett, the largest news publisher in the US, has sued Google, alleging it has monopolised the technology tools that publishers and advertisers use to buy and sell ad space. News publishers are forced by Google to sell ad space to the company at low prices, the lawsuit claims. \"These claims are simply wrong,\" Google Ads VP Dan Taylor said."}, {"category": "technology", "title": "AI to impact developers, but can't do integrating role: Ola ex-CTO", "content": "Ola's Co-founder and former CTO Ankit Bhati said the developer ecosystem will be impacted by artificial intelligence. However, he added that the impact will be less in terms of replacement and more in terms of leverage. \"The integrating role of a developer is not going anywhere, AI cannot do that,\" he further stated."}, {"category": "technology", "title": "Hexaware Technologies to hire 5,000-6,000 people: Executive", "content": "Hexaware Technologies is looking to hire 5,000-6,000 lateral talent for the current calendar year. \"There is so much volatility in the market and most companies aren't hiring. We are standing apart where we are still hiring and in decent numbers,\" Senthil Nayagam K, EVP of global revenue assurance and Chief Learning Officer at Hexaware Technologies told Moneycontrol."}, {"category": "technology", "title": "PM meets Paul Romer in US, talks about using tech to improve lives", "content": "Prime Minister Narendra Modi met Nobel laureate and World Bank's former Chief Economist, Paul Romer, during his visit to America. Sharing pictures from the meeting, the PM tweeted, \"We had extensive conversations on leveraging technology to improve lives. We also talked about how to make our cities more sustainable and people friendly.\" Meanwhile, Romer called it a \"great meeting\"."}, {"category": "technology", "title": "Google fixes Android bug that falsely showed WhatsApp using mic", "content": "Google on Wednesday said it has fixed the Android bug that falsely showed WhatsApp using users' phone mics. The issue had been raised by a Twitter engineer, who shared a screenshot showing WhatsApp using his phone's mic even when he was sleeping. \"Users can now update their WhatsApp to address this issue,\" Google said."}, {"category": "technology", "title": "AI to pave way for millions of startups, generate jobs: Airbnb CEO", "content": "Airbnb CEO Brian Chesky believes artificial intelligence (AI) will actually generate more jobs, particularly in entrepreneurship. In a recent interview, Chesky said the technology will propel \"millions of new startups\". He emphasised that it's easier to imagine jobs being displaced by AI than to envision the jobs that will be created, as it requires conceiving what does not exist yet. \n"}, {"category": "technology", "title": "You've to be Indian-American to run tech firms, jokes US lawmaker", "content": "Being an Indian-American used to be a challenge, US Congressman Ro Khanna said at INDUS X conference. He joked, \"Now...you almost have to be Indian-American to run one of these tech companies.\" Khanna claimed, \"Everyone in the [Silicon] Valley and other parts of the business world are looking at India as a place where they can diversify their supply chains.\""}, {"category": "entertainment", "title": "'Jalegi tere baap ki' dialogue revised in 'Adipurush', video shows new dialogue", "content": "'Adipurush' makers have revised Lord Hanuman's dialogue \"Jalegi tere baap ki\" after criticism. The word \"baap\" has been replaced with the word \"Lanka\". In a clip released online, Lord Hanuman tells Indrajeet, \"Kapda teri Lanka ka, tel teri Lanka ka, aag bhi teri Lanka ki, jalegi bhi teri Lanka hi.\""}, {"category": "entertainment", "title": "HC refuses urgent hearing on Hindu Sena's plea against 'Adipurush'", "content": "The Delhi High Court on Wednesday refused the urgent listing of a Public Interest Litigation (PIL) seeking a ban on the screening of the movie 'Adipurush', saying there was no urgency in the matter. Hindu Sena chief Vishnu Gupta filed the plea on Friday saying the film should not be certified for public exhibition as it has \"hurt Hindu sentiments\"."}, {"category": "entertainment", "title": "Video shows the moment Bebe Rexha was hit with a phone on her eye during concert", "content": "A video showing the moment pop star Bebe Rexha was hit on her eye with a phone thrown by a fan has surfaced online. The pop star, who was performing in New York, collapsed to her knees when the mobile hit her. She was later escorted from the venue with her hands pressed to her face."}, {"category": "entertainment", "title": "Disrespect of Gods won't be tolerated: Union Minister Giriraj on 'Adipurush'", "content": "Amid a controversy over the movie 'Adipurush', Union Minister Giriraj Singh has said disrespect of Gods won't be tolerated. \"Sometimes they make 'PK'...Sometimes they taunt our Gods...This has happened many times, now it won't be tolerated\" he said. The Om Raut directorial was released last week and it stars Prabhas as Lord Ram and Kriti Sanon as Goddess Sita. "}, {"category": "entertainment", "title": "Asit Modi would pinch my cheeks, say inappropriate things about my looks: Actress in FIR", "content": "The details of FIR filed against 'Taarak Mehta Ka Ooltah Chashmah' producer Asit Modi on basis of repeated complaints by an actress have been accessed by CNN-News18. In the FIR, the actress alleged he'd pinch her cheeks and say inappropriate things about her appearance. \"He'd also say...he would've hugged me if we were together while talking over...phone,\" the statement read."}, {"category": "entertainment", "title": "Dipika Kakar and Shoaib Ibrahim blessed with a baby boy; say 'It's a premature delivery'", "content": "Actors Dipika Kakar and Shoaib Ibrahim have been blessed with a baby boy. \"Alhamdulillah today 21st June 2023 early morning we were blessed with a baby boy. It's a premature delivery nothing much to worry. Keep us in your prayers,\" Ibrahim wrote in a story on Instagram. The actors tied the knot in 2018."}, {"category": "entertainment", "title": "Honey Singh gets death threat from gangster Goldy Brar, says 'I'm scared'", "content": "Rapper Honey Singh has received a death threat from gangster Goldy Brar, who's said to be hiding in Canada, and has approached the Delhi Police seeking protection. The threats were allegedly sent to the rapper and his staff on the phone. Confirming the threat, Singh said, \"I am scared, my family is also scared.\""}, {"category": "entertainment", "title": "Singer Choi Sung Bong, who faked cancer, found dead at his home in S Korea", "content": "Singer Choi Sung Bong was found dead at his home in South Korea at the age of 33. It is believed that he died by suicide after posting a message on his YouTube channel. The singer faced controversy after it was revealed that he had lied about being terminally ill, having various cancers and soliciting donations from public for treatment. "}, {"category": "entertainment", "title": "Of course, why not: Gautam Gulati on if he would ever date a fan", "content": "Actor Gautam Gulati, when asked if he would ever date a fan, said, \"Of course, why not.\" He also said that if he had to change his name, he would change it to 'Kabir' because he likes the name. He added that he loves his routine and says no to anyone asking him to go out for food or drinks. "}, {"category": "entertainment", "title": "I lost reputation the first day I started working: Cryus Broacha", "content": "Cyrus Broacha said he \"needed new ways of earning money\", which is why he participated in 'Bigg Boss OTT 2'. When questioned if he's worried about his image, Cyrus answered, \"Do you think coming on 'Bigg Boss' would affect my reputation? I lost [it] the...day I started working. I've no fears.\" However, he mentioned that he's worried about mental health. "}, {"category": "entertainment", "title": "Had butterflies in my stomach when I met Salman: Anupria Goenka", "content": "Actress Anupria Goenka said that when she met Salman Khan on the sets of 'Tiger Zinda Hai', she \"had butterflies\" in her stomach. \"He's someone I had grown up watching. Hence, to do a scene with him was quite surreal,\" the actress said. \"[Salman and Hrithik Roshan] appreciate talent and they're very respectful...[they] really make you feel comfortable,\" she added."}, {"category": "entertainment", "title": "Thought kids at school would laugh at me, said no: Jugal on Masoom", "content": "Jugal Hansraj said that he had initially rejected Shekhar Kapur's 'Masoom'. \"When I heard the story, I thought this kid cries a lot...Everyone in my school would laugh at me...call me a crybaby...I said no,\" Hansraj shared. He added that the filmmaker insisted that he wanted Jugal in the film. \"I actually had...lot of fun,\" Hansraj said about shooting 'Masoom'. "}, {"category": "entertainment", "title": "Who is anyone to say 'You can't do this': Zoya on nepotism talk", "content": "While speaking about training Suhana Khan, Agastya Nanda and Khushi Kapoor to deal with nepotism talk and negativity ahead of their movie 'The Archies', filmmaker Zoya Akhtar said, \"When you grow up in a house with parents you admire, you just end up doing things they do.\" \"Who is anyone to say, 'You can't do this',\" she added.\n"}, {"category": "entertainment", "title": "Kartik made me wait during 'Bhool...', I used to scold him: Kiara", "content": "Actress Kiara Advani, while talking about her 'Satyaprem Ki Katha' co-actor Kartik Aaryan, said the actor used to make her wait during the shoot of their 2022 film 'Bhool Bhulaiyaa 2'. \"I used to scold Kartik, would tell him not to come late this time over and make me wait,\" Kiara said. \"We've grown professionally and personally,\" she added."}, {"category": "entertainment", "title": "Marrying Ajay at the peak of my career was a tough decision: Kajol", "content": "Actress Kajol said that getting married to actor Ajay Devgn at the \"peak\" of her career was a \"tough decision\" for her. Calling it a \"game changer\" moment, Kajol added, \"A lot of instances in my life made me make tough decisions.\" The couple got married in 1999 after dating each other for a few years."}, {"category": "entertainment", "title": "I was a tabla player, never thought of becoming singer: Kumar Sanu", "content": "Singer Kumar Sanu said that he started his music career as a tabla player and never thought of becoming a singer. \"I was forced to sing at a show...when I saw the public is loving my singing, then my goal changed to that of becoming a singer,\" he recalled. Sanu added he grew up in a musical environment in Kolkata."}, {"category": "entertainment", "title": "When Prateik smiles, he looks exactly like Smita Patil: Shabana", "content": "Actress Shabana Azmi said it was \"deeply emotional\" for her to shoot with Smita Patil's son Prateik Patil Babbar. \"He bears an uncanny resemblance to Smita. When he smiles, he looks exactly like her,\" shared the actress who featured with Smita Patil in films such as 'Arth', 'Mandi' and others. \"Prateik is a disciplined actor,\" Azmi added. "}, {"category": "entertainment", "title": "Resonated with 'Tiku Weds..' uniquely: Kangana on turning producer", "content": "When asked why she decided to produce 'Tiku Weds Sheru', actress Kangana Ranaut said that she resonated with the film in a unique way after hearing the story. \"Whatever has been my reality...the struggles that I've had in the film industry...coming from a small town...and the way I've had a struggle-filled life...[I felt] it's based on that,\" she added."}, {"category": "entertainment", "title": "Rajamouli said Baahubali was litmus test for Mahabharata: Prasad", "content": "\nSS Rajamouli's father and writer Vijayendra Prasad shared that the filmmaker told him that with 'Baahubali' he was \"trying to check\" his own readiness for handling 'Mahabharata' at a later stage. \"Rajamouli said ['Baahubali'] is going to be...litmus test for that ultimate goal,\" Vijayendra shared. He added that it is because of Rajamouli that his work has gained recognition. "}, {"category": "entertainment", "title": "Two of my most favourite people: Kangana on Elon Musk, PM Modi", "content": "Actress Kangana Ranaut reacted to Elon Musk's latest statement that he's a fan of Prime Minister Narendra Modi. Sharing a picture of Elon Musk and PM Modi on Instagram, Kangana wrote, \"Two of my most favourite people. Such a lovely morning.\" On the work front, Kangana is busy in promotions of 'Tiku Weds Sheru', which marks her maiden production venture.  "}, {"category": "entertainment", "title": "It was hard to find 300 transgender people for 'Haddi': Producer", "content": "Producer Sanjay Saha said that finding 300 transgender people for Nawazuddin Siddiqui's 'Haddi' was \"very adventurous and hard\". He added that a transwoman named Renuka helped the filmmakers to learn about transgender community. \"She had brought some of her friends from the community to Nawaz so that he could get into the character and deeply understand their life,\" he added. "}, {"category": "entertainment", "title": "I feel like I didn't value your concern enough: Babil on late dad", "content": "Actor Babil Khan said that he feels like he did not value late actor-father Irrfan Khan's concern enough. \"I miss when you used to look at Ayaan and [me] with that glint in your eye as if nothing else existed...in those moments I realised you loved being a father more than being an actor,\" he added."}, {"category": "entertainment", "title": "Aamir remembered my 'Laal...' audition, I was embarrassed: Bajwa", "content": "Actress Sonam Bajwa recalled that when she had met Aamir Khan at the trailer launch of 'Carry On Jatta 3', she told him that she had auditioned for 'Laal Singh Chaddha', which he said he had seen. \"I didn't expect him to remember...I was so embarrassed...[The audition] wasn't that bad...[Makers]...changed their plan to cast an established Bollywood actress,\" she shared. "}, {"category": "entertainment", "title": "Looks aren't important for me, one should know how to talk: Gautam", "content": "Actor Gautam Gulati said looks are not important for him to feel attracted to a person and that one should know how to talk. \"A person should know...how to hold a conversation for hours...I love people like that...I love that energy...This is what attracts me to people...I'm not just talking about a woman, I'm also talking about guys,\" he added. "}, {"category": "entertainment", "title": "Admire her audacity: Mahesh Bhatt on Pooja entering 'Bigg Boss...'", "content": "Filmmaker Mahesh Bhatt reacted to his daughter Pooja Bhatt's participation in 'Bigg Boss OTT 2'. \"Life's greatest adventures begin when we step into the realm of the unknown with courage and curiosity. She has done just that. I admire her audacity,\" Bhatt told ETimes. Pooja, on the show, had opened up about battling alcohol addiction at the age of 44. "}]